results/results_c5_large/results_c5_large_run1/oltp_read_only_t32/sysbench.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 32 tps: 132.18 qps: 2134.60 (r/w/o: 1867.15/0.00/267.45) lat (ms,95%): 434.83 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 134.30 qps: 2153.56 (r/w/o: 1884.95/0.00/268.61) lat (ms,95%): 434.83 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 134.30 qps: 2148.10 (r/w/o: 1879.40/0.00/268.70) lat (ms,95%): 434.83 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 133.20 qps: 2135.99 (r/w/o: 1869.69/0.00/266.30) lat (ms,95%): 419.45 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 135.60 qps: 2168.01 (r/w/o: 1896.90/0.00/271.10) lat (ms,95%): 442.73 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 133.70 qps: 2136.40 (r/w/o: 1868.90/0.00/267.50) lat (ms,95%): 450.77 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 32 tps: 131.20 qps: 2100.19 (r/w/o: 1837.79/0.00/262.40) lat (ms,95%): 434.83 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 32 tps: 134.70 qps: 2152.81 (r/w/o: 1883.50/0.00/269.30) lat (ms,95%): 450.77 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 32 tps: 134.70 qps: 2156.40 (r/w/o: 1886.80/0.00/269.60) lat (ms,95%): 442.73 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 32 tps: 130.60 qps: 2092.30 (r/w/o: 1831.20/0.00/261.10) lat (ms,95%): 450.77 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 32 tps: 114.40 qps: 1829.81 (r/w/o: 1601.01/0.00/228.80) lat (ms,95%): 493.24 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 32 tps: 111.50 qps: 1785.20 (r/w/o: 1562.10/0.00/223.10) lat (ms,95%): 502.20 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            218904
        write:                           0
        other:                           31272
        total:                           250176
    transactions:                        15636  (129.97 per sec.)
    queries:                             250176 (2079.47 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      129.9671
    time elapsed:                        120.3074s
    total number of events:              15636

Latency (ms):
         min:                                   50.51
         avg:                                  245.95
         max:                                  647.54
         95th percentile:                      450.77
         sum:                              3845684.11

Threads fairness:
    events (avg/stddev):           488.6250/7.18
    execution time (avg/stddev):   120.1776/0.07